Del conjunto de datos del titanic.csv realiza las siguientes consultas usando query y sin usar query, generalmente con loc bastará. 

En algunas consultas hay que usar más cosas aparte del query.

In [1]:
import pandas as pd

df = pd.read_csv('titanic.csv')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [ ]:
# Consultar de los hombres, las columnas survived, pclass, age
df.query('Sex == "male"')[['Survived', 'Pclass', 'Age']].head()
df.loc[df['Sex'] == 'male', ['Survived', 'Pclass', 'Age']].head()

   Survived  Pclass   Age
0         0       3  22.0
4         0       3  35.0
5         0       3   NaN
6         0       1  54.0
7         0       3   2.0

In [ ]:
# Pasajeros de clase menor a 3 (2 y 1)
df.query('Pclass < 3').head()
df.loc[df['Pclass'] < 3].head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S

In [ ]:
# Hombres supervivientes, 2 consultas con operador and
df.query('Sex == "male" and Survived == 1').head()
df.loc[(df['Sex'] == 'male') & (df['Survived'] == 1)].head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
17,18,1,2,"Williams, Mr. Charles Eugene",male,NaN,0,0,244373,13.0000,NaN,S
21,22,1,2,"Beesley, Mr. Lawrence",male,34.0,0,0,248698,13.0000,D56,S
23,24,1,1,"Sloper, Mr. William Thompson",male,28.0,0,0,113788,35.5000,A6,S
36,37,1,3,"Mamee, Mr. Hanna",male,NaN,0,0,2677,7.2292,NaN,C
55,56,1,1,"Woolner, Mr. Hugh",male,NaN,0,0,19947,35.5000,C52,S

In [ ]:
# Pasajeros donde Hermanos/Conyuges es mayor a padres/hijos
df.query('SibSp > Parch').head()
df.loc[df['SibSp'] > df['Parch']].head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C

In [ ]:
# Pasajeros de Embarked S o C
df.query('Embarked == "S" or Embarked == "C"').head()
df.loc[(df['Embarked'] == 'S') | (df['Embarked'] == 'C')].head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [ ]:
# Cuantos pasarejos existen del Embarked S, hazlo a través de una variable y un f-string
embarked_value = 'S'
df.query(f'Embarked == "{embarked_value}"').shape[0]
# df.loc[df['Embarked'] == embarked_value].shape[0]

644

In [ ]:
# Sobrevivientes mayores de edad 
df.query('Survived == 1 and Age >= 18').head()
df.loc[(df['Survived'] == 1) & (df['Age'] >= 18)].head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S

In [ ]:
# Cuantos no supervivientes menores de edad habia de clase 3
df.query('Survived == 0 and Age < 18 and Pclass == 3').shape[0]
df.loc[(df['Survived'] == 0) & (df['Age'] < 18) & (df['Pclass'] == 3)].shape[0]

49

In [30]:
# La edad media de los supervivientes mujeres de clase 1 o de clase 2
print(f"La edad media es --> {df.query('Survived == 1 and Sex == "female" and (Pclass == 1 or Pclass == 2)')['Age'].mean()}")
print(f"La edad media es --> {df.loc[(df['Survived'] == 1) & (df['Sex'] == 'female') & ((df['Pclass'] == 1) | (df['Pclass'] == 2)), 'Age'].mean()}")

La edad media es --> 31.83
La edad media es --> 31.83

In [ ]:
# Mostrar supervivientes donde la edad es desconocida
df.query('Survived == 1 and Age.isnull()').head()
df.loc[(df['Survived'] == 1) & (df['Age'].isnull())].head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
17,18,1,2,"Williams, Mr. Charles Eugene",male,NaN,0,0,244373,13.0000,NaN,S
19,20,1,3,"Masselmani, Mrs. Fatima",female,NaN,0,0,2649,7.2250,NaN,C
28,29,1,3,"O'Dwyer, Miss. Ellen ""Nellie""",female,NaN,0,0,330959,7.8792,NaN,Q
31,32,1,1,"Spencer, Mrs. William Augustus (Marie Eugenie)",female,NaN,1,0,PC 17569,146.5208,B78,C
32,33,1,3,"Glynn, Miss. Mary Agatha",female,NaN,0,0,335677,7.7500,NaN,Q

In [ ]:
# Mostrar aquellos que no sobrevivieron y pagaron un precio entre 15 y 20
df.query('Survived == 0 and (Fare >= 15 and Fare <= 20)').head()
df.loc[(df['Survived'] == 0) & (df['Fare'] >= 15) & (df['Fare'] <= 20)].head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
18,19,0,3,"Vander Planke, Mrs. Julius (Emelia Maria Vande...",female,31.0,1,0,345763,18.0000,NaN,S
38,39,0,3,"Vander Planke, Miss. Augusta Maria",female,18.0,2,0,345764,18.0000,NaN,S
46,47,0,3,"Lennon, Mr. Denis",male,NaN,1,0,370371,15.5000,NaN,Q
49,50,0,3,"Arnold-Franchi, Mrs. Josef (Josefine Franchi)",female,18.0,1,0,349237,17.8000,NaN,S
135,136,0,2,"Richard, Mr. Emile",male,23.0,0,0,SC/PARIS 2133,15.0458,NaN,C

In [ ]:
# Consultar a través de una lista los los valores donde Embarked es S y C
embarked_list = ['S', 'C']
df.query('Embarked in @embarked_list').head()
df.loc[df['Embarked'].isin(embarked_list)].head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [ ]:
# Consultar aquellos donde el número de familiares totales es mayor a 5
df.query('(SibSp + Parch) > 5').head()
df.loc[(df['SibSp'] + df['Parch']) > 5].head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
13,14,0,3,"Andersson, Mr. Anders Johan",male,39.0,1,5,347082,31.2750,NaN,S
25,26,1,3,"Asplund, Mrs. Carl Oscar (Selma Augusta Emilia...",female,38.0,1,5,347077,31.3875,NaN,S
59,60,0,3,"Goodwin, Master. William Frederick",male,11.0,5,2,CA 2144,46.9000,NaN,S
68,69,1,3,"Andersson, Miss. Erna Alexandra",female,17.0,4,2,3101281,7.9250,NaN,S
71,72,0,3,"Goodwin, Miss. Lillian Amy",female,16.0,5,2,CA 2144,46.9000,NaN,S

In [ ]:
# Consultar cuántos supervivientes viajab sin familiares
df.query('Survived == 1 and (SibSp + Parch) == 0').shape[0]
df.loc[(df['Survived'] == 1) & ((df['SibSp'] + df['Parch']) == 0)].shape[0]

163

In [ ]:
# Consultar la mínima del hombre superviviente de tercera clase
print(f"El hombre más joven tiene {df.query('Sex == "male" and Survived == 1 and Pclass == 3')['Age'].min()} años")
print(f"El hombre más joven tiene {df.loc[(df['Sex'] == 'male') & (df['Survived'] == 1) & (df['Pclass'] == 3), 'Age'].min()} años")

El hombre más joven tiene 0.42 años

In [31]:
# Meter en una lista la cantidad de pasajeros por tipo de Embarked
embarked_types = df['Embarked'].unique().tolist()
passenger_counts = [df.query(f'Embarked == "{embarked}"').shape[0] for embarked in embarked_types]
print(passenger_counts)
# Meter en una lista la cantidad de pasajeros por tipo de Embarked
embarked_types = df['Embarked'].unique().tolist()
passenger_counts = [df.loc[df['Embarked'] == embarked].shape[0] for embarked in embarked_types]
print(passenger_counts)

[644, 168, 77, 0]
[644, 168, 77, 0]